# Project 1

In [17]:
import pandas as pd
class SIMS : 

    student_name = input("Enter your name: ")
    matric_no = input("Enter your matriculation number: ")
    department = input("Enter your department: ")
    level = int(input("Enter your level: "))


    record = {"Name" : [student_name], "Matric.No" : [matric_no] , "Department" : [department], "Level" : [level]}
    df = pd.DataFrame(record)
    df.to_csv('PAU_SIMS.csv')
    print("\n")
    print(df)

Enter your name: Ebuka
Enter your matriculation number: WE13e232313
Enter your department: CSC
Enter your level: 233


    Name    Matric.No Department  Level
0  Ebuka  WE13e232313        CSC    233

# Project 2

In [29]:
import pandas as pd
class corporation :
    company = { "Name" : ["Enron","Anderson","GK Jones","Mica","Dune"]  ,
          "Founding Date" : [1987,1936,2001,1996,2008],
          "Assets" : [1000000,1500000,3000000,250000,800000],
          "Liabilities" : [200000,500000,1500000,50000,300000] ,
          "Percentage Leverage (%)" : []}

    for i in range(len(company["Assets"])):
        assets = company["Assets"][i]
        liabilities = company["Liabilities"][i]
        leverage = (assets - liabilities)*100 / assets 
        company["Percentage Leverage (%)"].append(leverage)

    df = pd.DataFrame(company)
    df.to_csv("Corporation_data.csv")
df

       Name  Founding Date   Assets  Liabilities  Percentage Leverage (%)
0     Enron           1987  1000000       200000                80.000000
1  Anderson           1936  1500000       500000                66.666667
2  GK Jones           2001  3000000      1500000                50.000000
3      Mica           1996   250000        50000                80.000000
4      Dune           2008   800000       300000                62.500000